app/views/tasks/_index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."section_id" = ?  [["section_id", 1]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."section_id" = ? LIMIT ?  [["section_id", 1], ["LIMIT", 1]]
---
<% if not section.tasks.empty? %>
	<% section.tasks.each do |task| %>