app/views/sections/_index.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."project_id" = ?  [["project_id", 36]]
---
<% if @project.sections %>
  <% @project.sections.each do |section| %>