app/controllers/sections_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
---
	def new
		@project = Project.find(params[:project_id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 63], ["id", 1], ["LIMIT", 1]]
INSERT INTO "sections" ("name", "created_at", "updated_at", "project_id") VALUES (?, ?, ?, ?)  [["name", "inital tasks"], ["created_at", "2023-04-24 07:26:42.050862"], ["updated_at", "2023-04-24 07:26:42.050862"], ["project_id", 65]]
---
	def create
		@project = Project.find(params[:project_id])
		if @project.users.include? current_user
			@section = @project.sections.build(section_params)
			if @section.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."project_id" = ? AND "sections"."id" = ? LIMIT ?  [["project_id", 49], ["id", 1], ["LIMIT", 1]]
---
	def edit
		@project = Project.find(params[:project_id])
		@section = @project.sections.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 64], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 64], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."project_id" = ? AND "sections"."id" = ? LIMIT ?  [["project_id", 64], ["id", 2], ["LIMIT", 1]]
UPDATE "sections" SET "name" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["name", "sectoin 11"], ["updated_at", "2023-04-14 21:28:06.016517"], ["id", 1]]
---
	def update
		@project = Project.find(params[:project_id])

		if @project.users.include? current_user
			@section = @project.sections.find(params[:id])
			if @section.update(section_params)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."project_id" = ? AND "sections"."id" = ? LIMIT ?  [["project_id", 63], ["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 63], ["id", 1], ["LIMIT", 1]]
DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 3]]
---
	def destroy
		@project = Project.find(params[:project_id])
		@section = @project.sections.find(params[:id])

		if @project.users.include? current_user
			if @section.destroy