app/controllers/tasks_controller.rb

	def new
		@section = Section.find(params[:section_id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@section = Section.find(params[:section_id])
		@project = @section.project

		if @project.users.include? current_user
			@task = @section.tasks.build(task_params)

			if @task.save
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 63], ["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "section_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "new task"], ["description", ""], ["section_id", 1], ["created_at", "2023-04-24 07:26:52.273203"], ["updated_at", "2023-04-24 07:26:52.273203"], ["user_id", nil]]

	def edit
		@task = Task.preload(:section).find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def update
		@task = Task.preload(section: :project).find(params[:id])
		if @task.section.project.users.include? current_user
			if @task.update(task_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ?  [["id", 63]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ? AND "users"."id" = ? LIMIT ?  [["project_id", 63], ["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "first tasks updated"], ["updated_at", "2023-04-23 12:45:19.446436"], ["id", 2]]

	def destroy
		@task = Task.preload(section: :project).find(params[:id])
		@project = @task.section.project

		if @task.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ?  [["id", 63]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]